
Процедура ОткрытьПолноценныйФункционал()  Экспорт
	
	Обращение = "
	| Упс! Ты сделал это, Ты смог взломать эту СУПЕР-ЗАЩИТУ!!! 
	| Это значит, что данная обработка вызвала у тебя неподдельный интерес и она, наверное, тебе нужна! И это значит, что мои труды были не напрасны!
	| Как видишь обработка не урезана и ты можешь ей пользоваться полноценно!
	| 
	| Только у меня к тебе будет просьба:
	| 1. Не распространяй на других сайтах - мне интересно скольким людям будет интересна моя обработка.
	| 
	| 2. Не рассказывай о содержимом этого модуля - не разрушай мечту у других искателей сокровищь увидеть здесь что-то ценное
	| и дай им возможность удивиться - ведь это одно из самых прекрасных эмоций человека!
	| 
	| 3. Зайди на страничку http://infostart.ru/public/100480/ , поставь звёздочку, напиши что-то хорошее 
	| и в конце поставь смайлик - я буду знать что кто-то прочитал это обращение и оценил моё творчество.
	| 
	| С Уважением, Головченко С.А.
	| 
	|---------------------------------------------------------------------------------------------------------
	| P.S. Если ты всё-таки считаешь, что обработка стоит большего и захочешь сказать дополнительное 'Спасибо' не только 
	| в духовной, но и в материальной форме и тебя это не будет напрягать, то можешь перекинуть какую-то мелочь на мой кошелёк: 
	|   Кошелёк WebMoney:	U159545979805
	|						R760071405461
	|						Z187814925749
	|   
	|   Единый кошелёк:	    172537354161
	|   
	|   Кошелёк Яндекс-Денег: 410011235123056
	|   
	|   Карта ПриватБанка:  4731 2171 0553 6310 (Головченко Сергей Анатольевич)
	|   
	|---------------------------------------------------------------------------------------------------------";  
	
	
	ПолныйФункционалОткрыт = Ложь; // Тут нужно поставить "Истина", а можно и не ставить ))))
		
КонецПроцедуры

// Возвращает сведения о внешней обработке
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");//Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка);
	ПараметрыРегистрации.Вставить("Версия", "2.1.5.1");
	ПараметрыРегистрации.Вставить("Назначение", Новый Массив);
	ПараметрыРегистрации.Вставить("Наименование", "Gant 1С");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", "http://infostart.ru/public/100480/");
	//ПараметрыРегистрации.Вставить("ВерсияБСП", ВерсияБСП);

	ПараметрыРегистрации.Вставить("Команды", Новый ТаблицаЗначений);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
