////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.ЗначениеСсылка.Видимость	= (Запись.ИмяРесурса = "ЗначениеСсылка");
	Элементы.ЗначениеСтрока.Видимость	= (Запись.ИмяРесурса = "ЗначениеСтрока");
	Элементы.ЗначениеЧисло.Видимость	= (Запись.ИмяРесурса = "ЗначениеЧисло");
	Элементы.ЗначениеБулево.Видимость	= (Запись.ИмяРесурса = "ЗначениеБулево");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ИмяНастройкиПриИзменении(Элемент)
	Если Настройки.Свойство(Запись.ИмяНастройки) Тогда
		ПараметрыНастройки	= Настройки[Запись.ИмяНастройки];
		Запись.ИмяРесурса	= ПараметрыНастройки.ИмяРесурса;
		Если Запись.ИмяРесурса = "ЗначениеСсылка" Тогда
			Запись.ЗначениеСсылка = ПараметрыНастройки.Типы.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСсылкаОчистка(Элемент, СтандартнаяОбработка)
	Если Настройки.Свойство(Запись.ИмяНастройки) Тогда
		ПараметрыНастройки	= Настройки[Запись.ИмяНастройки];
		Если Запись.ИмяРесурса = "ЗначениеСсылка" Тогда
			Запись.ЗначениеСсылка = ПараметрыНастройки.Типы.ПривестиЗначение(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщиеНастройки = БазаЗнанийКлиентСерверПовтИсп.ПолучитьСтруктуруОбщихНастроекБазыЗнаний();
	Для Каждого КлючИЗначение Из ОбщиеНастройки Цикл
		Элементы.ИмяНастройки.СписокВыбора.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
