///////////////////////////////////////////////////////////
//НАЧАЛЬНЫЕ НАСТРОЙКИ

#Область НачальныеНастройки

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Год = ТекущаяДата();
	НачалоПериода = Параметры.ДатаНачала;
	КонецПериода = Параметры.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДекорации();
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////
//КОМАНДЫ ФОРМЫ

#Область КомандыФормы

&НаКлиенте
Процедура ВыборМесяц(Команда)
	
	НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени(ЭтаФорма.ТекущийЭлемент.Имя), 01));
	КонецПериода = КонецДня(КонецМесяца(НачалоПериода));
	ОбработатьРезультатИЗакрытьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбор(Команда)

	Если ЭтаФорма.ТекущийЭлемент.Заголовок = "I" Тогда 
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Январь"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,2)));
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "II" Тогда
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Апрель"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,2)));		
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "III" Тогда
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Июль"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,2)));		
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "IV" Тогда
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Октябрь"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,2)));
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "6 месяцев" Тогда
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Январь"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,5)));
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "9 месяцев" Тогда
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Январь"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,8)));
	Иначе 
		НачалоПериода = НачалоДня(Дата(Год(Год), ПолучитьНомерМесяцаПоИмени("Январь"), 01));
		КонецПериода = КонецДня(КонецМесяца(ДобавитьМесяц(НачалоПериода,11)));		
	КонецЕсли;
	ОбработатьРезультатИЗакрытьФорму();	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаГод(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент.Заголовок = "<<" Тогда
		Год = ДобавитьМесяц(Год,-12);
	Иначе 
		Год = ДобавитьМесяц(Год,12);	
	КонецЕсли;
	ОбновитьДекорации();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТекущий(Команда)
	
	Если ЭтаФорма.ТекущийЭлемент.Заголовок = "Этот день" Тогда 
		НачалоПериода = НачалоДня(ТекущаяДата());
		КонецПериода = КонецДня(ТекущаяДата());
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "Эта неделя" Тогда
		НачалоПериода = НачалоДня(НачалоНедели(ТекущаяДата()));
		КонецПериода = КонецДня(КонецНедели(ТекущаяДата()));		
	ИначеЕсли ЭтаФорма.ТекущийЭлемент.Заголовок = "Этот месяц" Тогда
		НачалоПериода = НачалоДня(НачалоМесяца(ТекущаяДата()));
		КонецПериода = КонецДня(КонецМесяца(ТекущаяДата()));		
	Иначе
		НачалоПериода = НачалоДня(НачалоГода(ТекущаяДата()));
		КонецПериода = КонецДня(КонецГода(ТекущаяДата()));
	КонецЕсли;
	ОбработатьРезультатИЗакрытьФорму();
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////////////////////////////
//СЛУЖЕБНЫЕ МЕТОДЫ

#Область СлужебныеМетоды

&НаКлиенте
Процедура ОбновитьДекорации()

	Элементы.ДекорацияГод.Заголовок = Год(Год);
	Элементы.ДекорацияДата.Заголовок = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");

КонецПроцедуры 

&НаКлиенте
Функция ПолучитьНомерМесяцаПоИмени(Имя)

	Если Имя = "Январь" Тогда
    	Возврат "01";
 	ИначеЕсли Имя = "Февраль" Тогда
    	Возврат "02";
 	ИначеЕсли Имя = "Март" Тогда
    	Возврат "03";
 	ИначеЕсли Имя = "Апрель" Тогда
    	Возврат "04";
 	ИначеЕсли Имя = "Май" Тогда
    	Возврат "05";
 	ИначеЕсли Имя = "Июнь" Тогда
    	Возврат "06";		
 	ИначеЕсли Имя = "Июль" Тогда
    	Возврат "07";
 	ИначеЕсли Имя = "Август" Тогда
    	Возврат "08";
 	ИначеЕсли Имя = "Сентябрь" Тогда
    	Возврат "09";
 	ИначеЕсли Имя = "Октябрь" Тогда
    	Возврат "10";
 	ИначеЕсли Имя = "Ноябрь" Тогда
    	Возврат "11";
 	ИначеЕсли Имя = "Декабрь" Тогда
    	Возврат "12";		
	 КонецЕсли;	

КонецФункции

&НаКлиенте
Процедура ОбработатьРезультатИЗакрытьФорму()

	Результат = Новый Структура;
	Результат.Вставить("ДатаНачала",НачалоПериода);
	Результат.Вставить("ДатаОкончания",КонецПериода);
	ЭтаФорма.Закрыть(Результат);

КонецПроцедуры 

&НаКлиенте
Процедура ВыборПроизвольный(Команда)
	ОбработатьРезультатИЗакрытьФорму();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	КонецПериода = КонецДня(НачалоПериода);
КонецПроцедуры

#КонецОбласти