
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтрокаHTML = Параметры.СтрокаHTML;
	
	ЭтотОбъект.АвтоЗаголовок	= Ложь;
	ЭтотОбъект.Заголовок		= ?(ПустаяСтрока(Параметры.Заголовок), "Просмотр...", Параметры.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура СтрокаHTMLДокументСформирован(Элемент)
	Попытка
		ИмяСайта = Элементы.СтрокаHTML.Документ.nameProp;
	Исключение
		ИмяСайта = ЭтотОбъект.Заголовок;
	КонецПопытки;
	
	Если ПустаяСтрока(ИмяСайта) ИЛИ ИмяСайта = ЭтотОбъект.Заголовок Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.АвтоЗаголовок	= Ложь;
	ЭтотОбъект.Заголовок		= ИмяСайта;
КонецПроцедуры
