
Функция ПолучитьТекстСтраницы(знач ДанныеСсылки) Экспорт
	
	Если ТипЗнч(ДанныеСсылки) = Тип("Строка") Тогда
		ДанныеСсылки = БазаЗнанийAPIКлиентСервер.РазобратьАдресСсылки(ДанныеСсылки);
	КонецЕсли;
	
	Если НЕ ДанныеСсылки.Команда = "page" Тогда
		Возврат "";
	КонецЕсли;
	
	ОбщиеФайлы		= БазаЗнанийHTMLКлиентСервер.ПолучитьОбщиеФайлы();
	ПараметрыСсылки = ДанныеСсылки.Параметры;
	ДопПараметры	= Неопределено;
	
	Если ПараметрыСсылки.name = "home" Тогда
		ДанныеСтраницы	= БазаЗнанийHTMLВызовСервера.ПолучитьДанныеГлавнойСтраницы(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "category" Тогда
		ДанныеСтраницы	= БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыКатегория(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "article" Тогда
		ДанныеСтраницы	= БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыСтатья(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "tag" Тогда
		ДанныеСтраницы	= БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыКлючевоеСлово(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "featured_articles" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "recently_added" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры); 
	ИначеЕсли ПараметрыСсылки.name = "most_popular" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "top_rated" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПоРейтингу(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "user" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыПользователь(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыНовостнаяЛента(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news_item" Тогда
		ДанныеСтраницы = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеСтраницыНовости(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	Иначе 
		ДанныеСтраницы = Новый Структура("Контент, Картинки, Стили, Заголовок", "", Неопределено, "", "");
	КонецЕсли;
	
	ОсноваСтраницы = БазаЗнанийHTMLКлиентСервер.ПолучитьОсновуСтраницы(
		ОбщиеФайлы.Картинки,
		ОбщиеФайлы.Скрипты,
		ДанныеСтраницы.Заголовок);
		
	ТекстHTML = СтрЗаменить(ОсноваСтраницы, "[[ОсновнойКонтент]]", ДанныеСтраницы.Контент);
	
	БазаЗнанийHTMLКлиентСервер.ОбработатьДополнительныеКартинки(ДанныеСтраницы.Картинки);
	
	Возврат ТекстHTML;
	
КонецФункции

Функция ПолучитьЧастьСтраницыОбновления(знач ДанныеСсылки) Экспорт
	
	Если ТипЗнч(ДанныеСсылки) = Тип("Строка") Тогда
		ДанныеСсылки = БазаЗнанийAPIКлиентСервер.РазобратьАдресСсылки(ДанныеСсылки);
	КонецЕсли;
	
	Если НЕ ДанныеСсылки.Команда = "refresh" Тогда
		Возврат "";
	КонецЕсли;
	
	ОбщиеФайлы		= БазаЗнанийHTMLКлиентСервер.ПолучитьОбщиеФайлы();
	ПараметрыСсылки = ДанныеСсылки.Параметры;
	ДопПараметры	= Неопределено;
	
	Если ПараметрыСсылки.name = "comments" Тогда
		ТекстHTML = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновлениеКомментариев(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "news" Тогда
		ТекстHTML = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновлениеНовостнойЛенты(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	ИначеЕсли ПараметрыСсылки.name = "articles" Тогда
		ТекстHTML = БазаЗнанийHTMLВызовСервера.ПолучитьДанныеОбновленияСтатей(ОбщиеФайлы.Картинки, ПараметрыСсылки, ДопПараметры);
	Иначе 
		ТекстHTML = "";
	КонецЕсли;
	
	Возврат ТекстHTML;
	
КонецФункции
