////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Автор) Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	Если Объект.Период = Дата(1, 1, 1) Тогда
		Объект.Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Элементы.Автор.ТолькоПросмотр = ЗначениеЗаполнено(Объект.Автор);
	
	Если ЗначениеЗаполнено(Параметры.Родитель) Тогда
		ЭтотОбъект.Родитель = Параметры.Родитель;
	Иначе 
		ЭтотОбъект.Родитель = Справочники.КомментарииБазыЗнаний.ПолучитьЗначениеРодитель(Объект.Ссылка);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ЭтотОбъект.Родитель) Тогда
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭтотОбъект.Родитель, "Автор, Период, Текст");
		
		ЭтотОбъект.АвторСообщения	= СтруктураРеквизитов.Автор;
		ЭтотОбъект.ТекстСообщения	= СтруктураРеквизитов.Текст;
		ЭтотОбъект.ПериодСообщения	= СтруктураРеквизитов.Период;
	КонецЕсли;
	
	Элементы.ГруппаВОтветНаСообщение.Видимость = ЗначениеЗаполнено(ЭтотОбъект.Родитель);
	
	ФорматированныйДокумент.УстановитьHTML(Объект.ТекстHTML, Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ФорматированныйДокумент.ПолучитьHTML(Объект.ТекстHTML, Новый Структура);
	Объект.Текст = ФорматированныйДокумент.ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.РодительСсылка = ЭтотОбъект.Родитель;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
