Процедура УстановитьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(РодительСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьСвязь(знач РодительСсылка, знач ПодчиненныйСсылка) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.СвязьКомментариевБазыЗнаний.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Родитель = РодительСсылка;
	МенеджерЗаписи.Ссылка	= ПодчиненныйСсылка;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	КонецЕсли;
	
КонецПроцедуры
