////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьДоступностьКнопокБлокировки(РедакторСтатьи = Неопределено)
	ДоступностьЗахвата		= Ложь;
	ДоступностьОсвобождения	= Ложь;
	
	Если НЕ ЗначениеЗаполнено(РедакторСтатьи) Тогда
		ДоступностьЗахвата = Истина;
	КонецЕсли;
	Если РедакторСтатьи = ТекущийПользователь ИЛИ РедакторСтатьи = Администратор Тогда
		ДоступностьОсвобождения = Истина;
	КонецЕсли;
	
	Элементы.ЗахватитьНаРедактирование.Доступность		= ДоступностьЗахвата;
	Элементы.МенюЗахватитьНаРедактирование.Доступность	= ДоступностьЗахвата;
	Элементы.ЗавершитьРедактирование.Доступность		= ДоступностьОсвобождения;
	Элементы.МенюЗавершитьРедактирование.Доступность	= ДоступностьОсвобождения;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьДоступностьКнопокБлокировки(ТекущиеДанные.Редактор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Администратор		= БазаЗнанийВызовСервера.ПолучитьЗначениеНастройки("Администратор");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗахватитьНаРедактирование(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ЗахватитьНаРедактированиеНаСервере(ТекущиеДанные.Ссылка);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеАдминистратором(Результат, ДопПараметры)
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗавершитьРедактированиеНаСервере(ДопПараметры.Статья);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Статья", ТекущиеДанные.Ссылка);
	Если ЗначениеЗаполнено(ТекущиеДанные.Редактор)
		И ТекущиеДанные.Редактор <> ТекущийПользователь Тогда
		
		Если ТекущийПользователь = Администратор Тогда
			ОбработкаОповещения	= Новый ОписаниеОповещения("ЗавершитьРедактированиеАдминистратором", ЭтотОбъект, ДопПараметры);
			ТекстВопроса		= НСтр("ru='При завершении редактирования администратором возможна потеря данных в параллельных сессиях.
			|Вы уверены что хотите продолжить?'");
			
			ПоказатьВопрос(ОбработкаОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, , КодВозвратаДиалога.Нет);
		Иначе 
			Возврат;
		КонецЕсли;
	Иначе 
		ЗавершитьРедактированиеАдминистратором(КодВозвратаДиалога.Да, ДопПараметры);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ

&НаСервереБезКонтекста
Функция ЗахватитьНаРедактированиеНаСервере(СтатьяСсылка)
	Возврат Справочники.СтатьиБазыЗнаний.ЗахватитьСтатьюНаРедактирование(СтатьяСсылка);
КонецФункции

&НаСервереБезКонтекста
Функция ЗавершитьРедактированиеНаСервере(СтатьяСсылка)
	Возврат Справочники.СтатьиБазыЗнаний.ЗавершитьРедактированиеСтатьи(СтатьяСсылка);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ НАСТРОЙКИ ПОРЯДКА ЭЛЕМЕНТОВ

&НаКлиенте
Процедура ПереместитьЭлементВверх(Команда)
	НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВверхВыполнить(Список, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементВниз(Команда)
	НастройкаПорядкаЭлементовКлиент.ПереместитьЭлементВнизВыполнить(Список, Элементы.Список);
КонецПроцедуры

