
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр аэОценкийСовещаний
	Движения.аэОценкийСовещаний.Записывать = Истина;
	Для Каждого ТекСтрокаОценкиСовещаний Из ОценкиСовещаний Цикл
		Движение = Движения.аэОценкийСовещаний.Добавить();
		Движение.Совещание = Совещание;
		Движение.Пользователь = Пользователь;
		Движение.Вопрос = ТекСтрокаОценкиСовещаний.Вопрос;
		Движение.Оценка = ТекСтрокаОценкиСовещаний.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
