
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗадачиПользователя.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователи.ТекущийПользователь());	
	
	
	
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
//|	аэПодразделенияРуководители.Ссылка КАК Ссылка
//|ПОМЕСТИТЬ Подразделения
//|ИЗ
//|	Справочник.аэПодразделения.Руководители КАК аэПодразделенияРуководители
//|ГДЕ
//|	аэПодразделенияРуководители.Пользователь = &Пользователь
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	узЗадачи.Ссылка КАК Ссылка,
//|	узЗадачи.аэИнициатор КАК аэИнициатор,
//|	узЗадачи.аэПодразделение КАК аэПодразделение
//|ПОМЕСТИТЬ ЗадачиПоПодразделениям
//|ИЗ
//|	Подразделения КАК Подразделения
//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.узЗадачи КАК узЗадачи
//|		ПО Подразделения.Ссылка = узЗадачи.аэПодразделение
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	узЗадачи.Ссылка КАК Ссылка
//|ПОМЕСТИТЬ ЗадачиПоПользователям
//|ИЗ
//|	Справочник.узЗадачи КАК узЗадачи
//|ГДЕ
//|	узЗадачи.аэИнициатор.Пользователь = &Пользователь
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ЕСТЬNULL(ЗадачиПоПодразделениям.Ссылка, ЗадачиПоПользователям.Ссылка) КАК Задача
//|ПОМЕСТИТЬ Задачи
//|ИЗ
//|	ЗадачиПоПользователям КАК ЗадачиПоПользователям
//|		ПОЛНОЕ СОЕДИНЕНИЕ ЗадачиПоПодразделениям КАК ЗадачиПоПодразделениям
//|		ПО (ЗадачиПоПодразделениям.Ссылка = ЗадачиПоПользователям.Ссылка)
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	Задачи.Задача,
//|	Задачи.Задача.аэИнициатор,
//|	Задачи.Задача.аэПодразделение
//|ИЗ
//|	Задачи КАК Задачи"	
КонецПроцедуры

&НаКлиенте
Процедура флОтображатьАктивныеЗадачиПриИзменении(Элемент)
	
	УстановитьФильтрЗадачПоСтатусам(флОтображатьАктивныеЗадачи);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьФильтрЗадачПоСтатусам(Флаг)
	
	СписокСтатусов = Новый Массив;
	ЗадачиПользователя.Параметры.УстановитьЗначениеПараметра("ПоказатьВсеЗадачи", Не флОтображатьАктивныеЗадачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	флОтображатьАктивныеЗадачи	 = Истина;
	УстановитьФильтрЗадачПоСтатусам(Истина);
	
КонецПроцедуры
