
&НаКлиенте
Процедура Включить(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Сервер1с) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю();
	//	Текст = "Не заполнен сервер 1с!!!";
	//	Сообщение.Текст = Текст;
	//	Сообщение.Поле = "Объект.Сервер1с";
	//	Сообщение.УстановитьДанные(Объект);
	//	Сообщение.Сообщить();

	//	Возврат;
	//КонецЕсли; 
	 
	ВключитьТЖ();
КонецПроцедуры

&НаСервере
Процедура ВключитьТЖ()
	
	//ОбъектСпр = Объект.Сервер1с.ПолучитьОбъект();
	//ОбъектСпр.ВключитьМониторинг = Истина;
	//ОбъектСпр.Записать();
	//ТехнологическийЖурнал_Status.ВключитьТехнологическийЖурнал(Объект.Сервер1с);
	
	ТехнологическийЖурнал_Status.ВключитьМониторинг();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Сервер1с) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю();
	//	Текст = "Не заполнен сервер 1с!!!";
	//	Сообщение.Текст = Текст;
	//	Сообщение.Поле = "Объект.Сервер1с";
	//	Сообщение.УстановитьДанные(Объект);
	//	Сообщение.Сообщить();

	//	Возврат;
	//КонецЕсли; 
	
	ПодключитьОбработчикОжидания("ОтобразитьИндикатор",1);
	 
	ОбработатьнаСервере(Объект.Сервер1с);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьнаСервере(Сервер1с)
	
	Если ИнформационнаяБазаФайловая() Тогда
		ТехнологическийЖурнал_Status.ОбработатьФайлыТехнологическогоЖурнала(Сервер1с);
	Иначе
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Сервер1с);
		ФоновыеЗадания.Выполнить("ТехнологическийЖурнал_Status.ОбработатьФайлыТехнологическогоЖурнала",МассивПараметров,"ОбработкаЛоговТЖ","Обработка файлов логов ТЖ");
	КонецЕсли;
	
	

КонецПроцедуры
  
 &НаСервереБезКонтекста
Функция ИнформационнаяБазаФайловая()
			
	
	СтрокаСоединенияИнформационнойБазы =  СтрокаСоединенияИнформационнойБазы();
	
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы), "FILE=") = 1;
	
КонецФункции 


&НаКлиенте
Процедура ПроверитьВебСервис(Команда)
	
	Ошибка = "";
	
	ВызватьВебСервис(Ошибка);
	
	Если Ошибка = "" Тогда
		Предупреждение("Соединение с веб-сервисом успешно установленно!");
	Иначе
		Предупреждение("Не удалось соединиться с веб-сервисом!!!");
		Сообщить(Ошибка);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВызватьВебСервис(Ошибка)
	Ошибка = ТехнологическийЖурнал_Status.ПроверкаВебСервиса();
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИндикатор()
	
	Структура  =  ПолучитьСтруктуруИндикатора();
	
	Индикатор = Структура.Индикатор;
    Элементы.Надпись.Заголовок = Структура.ТекстИндикатора;
	
	Если Структура.ЗавершитьОбработку Тогда
		
		ОтключитьОбработчикОжидания("ОтобразитьИндикатор");
	КонецЕсли;	
 
		
КонецПроцедуры
  

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруИндикатора()
	
	ТекстИндикатора = "Обработка данных начата";
	ЗавершитьОбработку = Ложь;
	Индикатор = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сервис", Перечисления.Сервисы.Status);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеИндикатораОбработки.НомерПотока КАК НомерПотока,
	|	ДанныеИндикатораОбработки.ВсегоФайлов КАК ВсегоФайлов,
	|	ДанныеИндикатораОбработки.НомерТекущегоФайла КАК НомерТекущегоФайла,
	|	ДанныеИндикатораОбработки.НомерТекущейСтроки,
	|	ДанныеИндикатораОбработки.ВсегоСтрок,
	|	ДанныеИндикатораОбработки.ПутьКФайлу,
	|	ДанныеИндикатораОбработки.ОтправленоЗапросов КАК ОтправленоЗапросов,
	|	ДанныеИндикатораОбработки.ОбработкаЗавершена КАК ОбработкаЗавершена,
	|	ДанныеИндикатораОбработки.ДатаФайла,
	|	ДанныеИндикатораОбработки.ВсегоСтрокОбработано КАК ВсегоСтрокОбработано,
	|	ДанныеИндикатораОбработки.РазмерОбработанныхФайлов КАК РазмерОбработанныхФайлов
	|ИЗ
	|	РегистрСведений.ДанныеИндикатораОбработки КАК ДанныеИндикатораОбработки
	|ГДЕ
	|	ДанныеИндикатораОбработки.Сервис = &Сервис
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПотока
	|ИТОГИ
	|	МИНИМУМ(ВсегоФайлов),
	|	СУММА(НомерТекущегоФайла),
	|	СУММА(ОтправленоЗапросов),
	|	МИНИМУМ(ОбработкаЗавершена),
	|	СУММА(ВсегоСтрокОбработано),
	|	СУММА(РазмерОбработанныхФайлов)
	|ПО
	|	ОБЩИЕ";
	
	
	ОбщиеДанные = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ОбщиеДанные.Следующий() Цикл
		
		Если ОбщиеДанные.ВсегоФайлов = 0 Тогда
			Индикатор = 100;
		Иначе
			Индикатор = Окр(ОбщиеДанные.НомерТекущегоФайла/ОбщиеДанные.ВсегоФайлов*100);
		КонецЕсли;
		
		Если ОбщиеДанные.ОбработкаЗавершена Тогда
			ТекстИндикатора = "Обработка данных завершена. "+Символы.ПС+
			"Обработано файлов: "+Строка(ОбщиеДанные.ВсегоФайлов)+Символы.ПС+
			"Обработано количество строк: "+Строка(ОбщиеДанные.ВсегоСтрокОбработано)+Символы.ПС+
			"Обработан общий размер файлов (КБайт): "+Строка(ОбщиеДанные.РазмерОбработанныхФайлов/1000)+Символы.ПС+
			"Отправлено запросов по веб-сервису: "+Строка(ОбщиеДанные.ОтправленоЗапросов);
			ЗавершитьОбработку = ИСТИНА;
			Индикатор = 100;
		Иначе
			ТекстИндикатора = "";
			
			Выборка = ОбщиеДанные.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.ОбработкаЗавершена Тогда
					ТекстИндикатора = ТекстИндикатора+?(ТекстИндикатора="","",Символы.ПС)+?(Выборка.НомерПотока=0,"",Строка(Выборка.НомерПотока)+".")+" Отправлено запросов по веб-сервису: "+ СокрЛП(Выборка.ОтправленоЗапросов)+" ("+Строка(Выборка.ДатаФайла)+")";
				Иначе	
					ТекстИндикатора = ТекстИндикатора+?(ТекстИндикатора="","",Символы.ПС)+?(Выборка.НомерПотока=0,"",Строка(Выборка.НомерПотока)+".")+" Обрабатывается файл: "+ Строка(Выборка.НомерТекущегоФайла)+" "+ СокрЛП(Выборка.ПутьКФайлу)+
					Символы.ПС+"обработка файла: "+СокрЛП(Выборка.НомерТекущейСтроки)+"/"+СокрЛП(Выборка.ВсегоСтрок)
					+?(Выборка.НомерПотока=0,"",Символы.ПС+" обработано в потоке: количество строк - "+Строка(Выборка.ВсегоСтрокОбработано)+"; размер файлов (Кбайт) -"+Строка(Цел(Выборка.РазмерОбработанныхФайлов/1000)));
				КонецЕсли;
			КонецЦикла;	
			
			
	
		КонецЕсли;	
		
	КонецЦикла;	
		
	
	СтруктураИндикатора = Новый Структура;
	СтруктураИндикатора.Вставить("ЗавершитьОбработку",ЗавершитьОбработку);
	СтруктураИндикатора.Вставить("ТекстИндикатора",ТекстИндикатора);
	СтруктураИндикатора.Вставить("Индикатор",Индикатор);

	
	Возврат  СтруктураИндикатора; 
КонецФункции 

&НаКлиенте
Процедура ВыключитьМониторинг(Команда)
	//Если НЕ ЗначениеЗаполнено(Объект.Сервер1с) Тогда
	//	
	//	Сообщение = Новый СообщениеПользователю();
	//	Текст = "Не заполнен сервер 1с!!!";
	//	Сообщение.Текст = Текст;
	//	Сообщение.Поле = "Объект.Сервер1с";
	//	Сообщение.УстановитьДанные(Объект);
	//	Сообщение.Сообщить();

	//	Возврат;
	//КонецЕсли; 
	 
	ВыключитьТЖ();

КонецПроцедуры

&НаСервере
Процедура ВыключитьТЖ()
	
	//ОбъектСпр = Объект.Сервер1с.ПолучитьОбъект();
	//ОбъектСпр.ВключитьМониторинг = Истина;
	//ОбъектСпр.Записать();
	
	ТехнологическийЖурнал_Status.ВыключитьМониторинг(Объект.Сервер1с);
КонецПроцедуры

