
&НаСервере
Процедура КомандаСформироватьТекстСкриптаSQLНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	аэИндексы.СкриптСоздания  КАК СкриптСоздания
	|ИЗ
	|	Справочник.аэИндексы КАК аэИндексы
	|ГДЕ
	|	НЕ аэИндексы.ПометкаУдаления";

	ТЗРезультат = Запрос.Выполнить().Выгрузить();

	ТекстЗапросаSQL = "";
	
	Для каждого СтрТЗ из ТЗРезультат Цикл

		ТекОкончаниеТекста = Прав(СокрЛП(СтрТЗ.СкриптСоздания), 1);
		
		ТекстЗапросаSQL = ТекстЗапросаSQL + СокрЛП(СтрТЗ.СкриптСоздания) + ?(ТекОкончаниеТекста = ";", "", ";") + Символы.ВК + " GO " + Символы.ВК;
		
	КонецЦикла;
	
	СкриптSQL = ТекстЗапросаSQL;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьТекстСкриптаSQL(Команда)
	
	КомандаСформироватьТекстСкриптаSQLНаСервере();
	//Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияЗначения");
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияЗначения", ЭтотОбъект),СкриптSQL,"ЁЁЁ",, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияЗначения() Экспорт

	

КонецПроцедуры
 
