////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ СТРАНИЦ БАЗЫ ЗНАНИЙ

Процедура УдалитьДублирующиесяЭлементыПоиска(МассивЭлементов)
	Если НЕ ТипЗнч(МассивЭлементов) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	МассивПроверки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивЭлементов);
	
	УникальныеЭлементы = Новый Массив;
	
	Для Каждого ТекстПоиска Из МассивЭлементов Цикл
		ЭлементНайден = Ложь;
		
		ИндексЭлемента	= МассивПроверки.Найти(ТекстПоиска);
		Если ИндексЭлемента <> Неопределено Тогда
			МассивПроверки.Удалить(ИндексЭлемента);
		КонецЕсли;
	
		Для Каждого ТекстПроверки Из МассивПроверки Цикл
			Если Найти(ТекстПроверки, ТекстПоиска) > 0 Тогда
				ЭлементНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЭлементНайден Тогда
			УникальныеЭлементы.Добавить(ТекстПоиска);
		КонецЕсли;
	КонецЦикла;
	
	МассивЭлементов = УникальныеЭлементы;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ОбработатьРезультатПолнотекстовогоПоиска(Текст1С, МассивЭлементов) Экспорт
	
	НРегТекст1С		= НРег(Текст1С);
	НачалоСтраницы	= Найти(НРегТекст1С, "<body>");
	КонецСтраницы	= Найти(НРегТекст1С, "</body>");
	ТекстРезультата	= Сред(Текст1С, НачалоСтраницы + 6, КонецСтраницы - НачалоСтраницы - 6);
	
	Счетчик = 0;
	Для Каждого СтатьяСсылка Из МассивЭлементов Цикл
		ПодстрокаПоиска	= "href=""#"" sel_num=""" + Формат(Счетчик, "ЧДЦ=; ЧН=0; ЧГ=") + """";
		
		Если ТипЗнч(СтатьяСсылка) = Тип("СправочникСсылка.СтатьиБазыЗнаний") Тогда
			ПараметрыСсылки	= Новый Структура;
			ПараметрыСсылки.Вставить("id", Строка(СтатьяСсылка.УникальныйИдентификатор()));
			АдресСсылки = БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("article", ПараметрыСсылки);
			ПодстрокаЗамены	= "href='" + АдресСсылки + "'";
		Иначе 
			Продолжить;
		КонецЕсли;
		
		ТекстРезультата = СтрЗаменить(ТекстРезультата, ПодстрокаПоиска, ПодстрокаЗамены);
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	ТекстРезультата = СтрЗаменить(ТекстРезультата, "Статьи базы знаний: ", "");
	
	ТекстСтраницы = "<html>
	|" + БазаЗнанийCSSКлиентСервер.ПолучитьТаблицуСтилейПоиска() + "
	|<body>
	|" + ТекстРезультата + "
	|</body>
	|</html>";
	
	Возврат ТекстСтраницы;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПРИЛОЖЕНИЯ

Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы(ОбрабатыватьПараметрыЗапуска) Экспорт
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ) Экспорт
	
	БазаЗнанийВызовСервера.ПередЗавершениемРаботыСистемыНаСервере(Отказ);
	
КонецПроцедуры
