
// СтандартныеПодсистемы

// Хранилище глобальных переменных.
//
// ПараметрыПриложения - Соответствие - хранилище переменных, где:
//   * Ключ - Строка - имя переменной в формате "ИмяБиблиотеки.ИмяПеременной";
//   * Значение - Произвольный - значение переменной.
//
// Инициализация (на примере СообщенияДляЖурналаРегистрации):
//   ИмяПараметра = "СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации";
//   Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
//     ПараметрыПриложения.Вставить(ИмяПараметра, Новый СписокЗначений);
//   КонецЕсли;
//  
// Использование (на примере СообщенияДляЖурналаРегистрации):
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"].Добавить(...);
//   ПараметрыПриложения["СтандартныеПодсистемы.СообщенияДляЖурналаРегистрации"] = ...;
Перем ПараметрыПриложения Экспорт;
Перем мСтруктураКэшДанных Экспорт;

// Конец СтандартныеПодсистемы


#Область ОбработчикиСобытий

Процедура ПередНачаломРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПриНачалеРаботыСистемы();
	// Конец СтандартныеПодсистемы
	
	
	узОткрытьСправочникЗадачи();
	
	аэОткрытьРабочийСтолОценкиСовещаний();
	
	Параметры = Новый Структура;
	Параметры.Вставить("ПараметрЗапуска", ПараметрЗапуска);
	
	аэОбщийМодульКлиент.ПриНачалеРаботыСистемы(Параметры);
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска, ",");
	Если Массив.Количество() > 0 Тогда
		
		Если Массив[0] = "ОткрытьЗадачу" Тогда
			
			СсылкаНаЗадачу = аэОбщийМодульСервер.ПолучитьСсылкуСправочникаЗадачи(Массив[1]);
			
			Если ЗначениеЗаполнено(СсылкаНаЗадачу) Тогда
				ПараметрОткрытия = Новый Структура("Ключ", СсылкаНаЗадачу);
				ОткрытьФорму("Справочник.узЗадачи.Форма.ФормаЭлемента", ПараметрОткрытия);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура аэОткрытьРабочийСтолОценкиСовещаний()
	//аэОбщийМодульСервер.ОтправитьТестовоеПисьмо(ПараметрЗапуска);
	
	Если аэОбщийМодульСервер.ПроверитьДоступностьРоли("аэИспользованиеРабочегоСтолаОценкиСовещаний") Тогда
		ОткрытьФорму("Обработка.аэОпросПользователя.Форма.Форма");
	КонецЕсли;
	
КонецПроцедуры

Процедура узОткрытьСправочникЗадачи()
	Если ПараметрыПриложения.Количество() = 1 Тогда //ЭтоНачальноеЗаполнениеДанных
		Возврат;
	Конецесли;
	Если Не аэОбщийМодульСервер.ПроверитьДоступностьРоли("аэДоступККанбанДоске") и НЕ аэОбщийМодульСервер.ПроверитьДоступностьРоли("полныеПрава") Тогда
		Возврат;
	КонецЕсли;
	Если узОбщийМодульСервер.узОткрыватьСправочникЗадачиПриНачалеРаботыСистемы() Тогда
		ОткрытьФорму("Обработка.узКанбанДоска.Форма");
	Конецесли;
КонецПроцедуры 


Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПередЗавершениемРаботыСистемы(Отказ);
	// Конец СтандартныеПодсистемы
	
КонецПроцедуры

#КонецОбласти

мСтруктураКэшДанных = Новый Структура;