
Функция ПолучитьСтруктуруПараметров() Экспорт
	
	Настройка = Новый Структура;
	Настройка.Вставить("SQLServer");
	Настройка.Вставить("SQLБаза");
	Настройка.Вставить("SQLЛогин");
	Настройка.Вставить("SQLПароль");
	Настройка.Вставить("Сервер1С");
	Настройка.Вставить("База1С");
	Настройка.Вставить("Пользователь1С");
	Настройка.Вставить("Пароль1С");
	Настройка.Вставить("КлючБазыДляВебСервиса");
	Настройка.Вставить("ТаймаутПодключения");
	Настройка.Вставить("КаталогСервера1С");
	Настройка.Вставить("КаталогСервераСУБД");
	Настройка.Вставить("Ссылка");
	Настройка.Вставить("НомерБазы",1);
	
	Настройка.Вставить("ФормироватьПочтовыеФайлы");
	Настройка.Вставить("ПутьКФайламПочтовыхВложений");
	Настройка.Вставить("ЭлектроннаяПочтаСервиса");
	Настройка.Вставить("ВерсияПлатформы"); 
	
	Настройка.Вставить("Результат"); 
	
	Возврат Настройка;

КонецФункции

Процедура sqlsize_СобратьДанныеОбИзмененияхКонфигурации() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОбИзмененияхКонфигурации(Настройка);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеЕжедневно() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОЕжедневныхПараметрахСервера(Настройка);
			СборИнформации.СобратьДанныеОбИндексах(Настройка);
			СборИнформации.СобратьДанныеОРегламентныхЗаданиях(Настройка);
			СборИнформации.СобратьДанныеОбщесистемныеОжидания(Настройка);
			СборИнформации.ОтправитьДанныеОСистемныхСчетчиках(Настройка);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеЕженедельно() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОЕженедельныхПараметрахСервера(Настройка);
			СборИнформации.СобратьДанныеОЕженедельныхПараметрахБазы(Настройка);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОПроцессоре() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОЗагрузкеПроцессора(Настройка);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОРазмере() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка);
			СборИнформации.СобратьДанныеОМетаданных(Настройка);
			СборИнформации.СобратьДанныеОРазмере(Настройка);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОФрагментации() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОМетаданных(Настройка);
			СборИнформации.СобратьДанныеОФрагментации(Настройка);
		
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОБекапах() Экспорт
	
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОБекапах(Настройка);
		КонецЕсли;
	КонецЦикла;  
	
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОбИтогах() Экспорт
	////Выборка = Справочники.Настройки.Выбрать();
	////Пока Выборка.Следующий() Цикл
	////	Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
	////		Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
	////		ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
	////		СборИнформации.СборДанныхОНулевыхИтогах(Настройка);
	////	КонецЕсли;
	////КонецЦикла;  

	Настройка = ПолучитьСтруктуруПараметров();
	//ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
	СборИнформации.СборДанныхОНулевыхИтогах(Настройка);
	
	
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОбОжиданиях() Экспорт
	
	// для одного серера SQL обрабатываем нескольких учетных записей
	// Параметры подключения берем по первой настройке
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Настройки.Ссылка,
	|	Настройки.SQLServer КАК SQLServer,
	|	Настройки.КлючБазыДляВебСервиса
	|ИЗ
	|	Справочник.Настройки КАК Настройки
	|ГДЕ
	|	Настройки.Включена
	|	И НЕ Настройки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Настройки.Код
	|ИТОГИ ПО
	|	SQLServer";
	
	ВыборкаСервер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСервер.Следующий() Цикл
		
		Настройка = Неопределено;
		СписокУчетныхЗаписей = Новый Массив;
		
		ВыборкаНастройки = ВыборкаСервер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНастройки.Следующий() Цикл
			Если Настройка = Неопределено Тогда
				Настройка = ВыборкаНастройки.Ссылка;
			КонецЕсли;
			СписокУчетныхЗаписей.Добавить(ВыборкаНастройки.КлючБазыДляВебСервиса);			
		КонецЦикла;
		
		// получаем статистику
		СтруктураПараметров = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Настройка);
		
		СборИнформации.СобратьДанныеОбОжиданиях(СтруктураПараметров, СписокУчетныхЗаписей);
				
	КонецЦикла;
	
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОЗапросахНагружающихПроцессор() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СборДанныхОЗапросахНагружающихПроцессор(Настройка);
		КонецЕсли;
	КонецЦикла;  	
КонецПроцедуры

Процедура sqlsize_СобратьДанныеОСистемныхСчетчиках() Экспорт
	Выборка = Справочники.Настройки.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Включена И НЕ Выборка.ПометкаУдаления Тогда
			Настройка = ОбщегоНазначения.ПолучитьСтруктуруПараметров();
			ЗаполнитьЗначенияСвойств(Настройка, Выборка.Ссылка);
			СборИнформации.СобратьДанныеОСистемныхСчетчиках(Настройка);
		КонецЕсли;
	КонецЦикла;  	
КонецПроцедуры