
&НаКлиенте
Процедура Включить(Команда)
	ВключитьМониторинг();
КонецПроцедуры

&НаСервере
Процедура ВключитьМониторинг()
	ТехнологическийЖурнал.ВключитьМониторинг();
КонецПроцедуры
 
&НаКлиенте
Процедура Выключить(Команда)
	ВыключитьМониторинг();
	//ПроверкаВключенияМониторинга();
КонецПроцедуры

&НаСервере
Процедура ВыключитьМониторинг()
	ТехнологическийЖурнал.ВыключитьМониторинг();
	
КонецПроцедуры

// события технолгического журнала
&НаКлиенте
Процедура ВключитьСобытияТЖ(Команда)
	ВключитьСобытияТЖСервер();
КонецПроцедуры

&НаСервере
Процедура ВключитьСобытияТЖСервер()
	ТехнологическийЖурнал_Status.ВключитьМониторинг();
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьСобытияТЖ(Команда)
	ВыключитьСобытияТЖСервер();
КонецПроцедуры

&НаСервере
Процедура ВыключитьСобытияТЖСервер()
	ТехнологическийЖурнал_Status.ВыключитьМониторинг();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СостояниеСервисов = ПолучитьСостояниеМониторинга();
	//МониторингДолгихЗапросовВключен = СостояниеСервисов.QueryTJ;
	//МониторингСобытийТЖВключен = СостояниеСервисов.Status;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ФормаВключить.Видимость = Не МониторингДолгихЗапросовВключен;
	Элементы.ФормаВыключить.Видимость = МониторингДолгихЗапросовВключен;
	
	Элементы.ВключитьСобытияТЖ.Видимость = Не МониторингСобытийТЖВключен;
	Элементы.ВыключитьСобытияТехнологическогоЖурнала.Видимость = МониторингСобытийТЖВключен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСостояниеМониторинга();
	ПодключитьОбработчикОжидания("ОбновитьСостояниеМониторинга", 60);
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьСостояниеМониторинга()
	СостояниеСервисов = ПолучитьСостояниеМониторинга();
	МониторингДолгихЗапросовВключен = СостояниеСервисов.QueryTJ;
	МониторингСобытийТЖВключен = СостояниеСервисов.Status;
	УстановитьВидимость();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеМониторинга()
	Возврат ТехнологическийЖурнал.ПолучитьСостояниеМониторинга();
КонецФункции
