////////////////////////////////////////////////////////////////////////////////
// ОБЩАЯ ФУНКЦИОНАЛЬНОСТЬ

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеГлавнойСтраницы(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентГлавнойСтраницы(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"База знаний (основная)");
	
КонецФункции

Функция ПолучитьДанныеСтраницыКатегория(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	КатегорияСсылка			= Справочники.КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, КатегорияСсылка);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентКатегории(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Категория: " + Строка(КатегорияСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыСтатья(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	СтатьяСсылка			= Справочники.СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, СтатьяСсылка);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентСтатьи(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Статья: " + Строка(СтатьяСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыКлючевоеСлово(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСлова		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСлова);
	КлючевоеСловоСсылка		= Справочники.КлючевыеСловаБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ИдентификаторКатегории	= ?(ПараметрыСсылки.Свойство("category"), ПараметрыСсылки.category, "");
	Если НЕ ПустаяСтрока(ИдентификаторКатегории) Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор(ИдентификаторКатегории);
		КатегорияСсылка			= Справочники.КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	Иначе 
		КатегорияСсылка			= Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("КлючевоеСлово", КлючевоеСловоСсылка);
	ПараметрыВыполнения.Вставить("Категория"	, КатегорияСсылка);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентКлючевогоСлова(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Ключевое слово: " + Строка(КлючевоеСловоСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыПоРейтингу(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПараметрыПоВиду = БазаЗнанийHTMLКлиентСервер.ПолучитьПараметрыВыводаСтраницыПоВиду(ПараметрыСсылки.name);
	
	Страница = ?(ПараметрыСсылки.Свойство("target"), ПараметрыСсылки.target, "");
	Если ПараметрыСсылки.Свойство("id") Тогда
		ИдентификаторСтатьи		= ПараметрыСсылки.id;
		УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
		СтатьяСсылка 			= Справочники.СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	Иначе 
		СтатьяСсылка			= Неопределено;
	КонецЕсли;
	
	НомерСтраницы = ?(ПараметрыСсылки.Свойство("pagenum"), ПараметрыСсылки.pagenum, 1);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("ВидСтраницы"	, ПараметрыСсылки.name);
	ПараметрыВыполнения.Вставить("НомерСтраницы", НомерСтраницы);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентСтатьиПоРейтингу(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		ПараметрыПоВиду.Заголовок);
	
КонецФункции

Функция ПолучитьДанныеСтраницыПользователь(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	ПользовательСсылка		= Справочники.Пользователи.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Пользователь"	, ПользовательСсылка);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентПрофиляПользователя(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Пользователь: " + Строка(ПользовательСсылка));
	
КонецФункции

Функция ПолучитьДанныеСтраницыНовостнаяЛента(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	НомерСтраницы = ?(ПараметрыСсылки.Свойство("pagenum"), ПараметрыСсылки.pagenum, 1);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("НомерСтраницы", НомерСтраницы);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентНовостнаяЛента(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Новостная лента");
	
КонецФункции

Функция ПолучитьДанныеСтраницыНовости(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторНовости	= ПараметрыСсылки.id;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторНовости);
	НовостьСсылка			= Справочники.НовостиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, НовостьСсылка);
	
	ТекстСтраницы = БазаЗнанийHTML.ПолучитьКонтентНовости(ПараметрыВыполнения);
	
	Возврат Новый Структура("Контент, Картинки, Заголовок",
		ТекстСтраницы,
		ПараметрыВыполнения.ДопКартинки,
		"Новость: " + Строка(НовостьСсылка));
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ЧАСТЕЙ СТРАНИЦ БАЗЫ ЗНАНИЙ

Функция ПолучитьДанныеОбновлениеКомментариев(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ИдентификаторСтатьи		= ПараметрыСсылки.article;
	УникальныйИдентификатор	= Новый УникальныйИдентификатор(ИдентификаторСтатьи);
	СтатьяСсылка			= Справочники.СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	ПараметрыВыполнения.Вставить("Ссылка"		, СтатьяСсылка);
	
	Возврат БазаЗнанийHTML.ПолучитьБлокКомментарии(ПараметрыВыполнения);
	
КонецФункции

Функция ПолучитьДанныеОбновлениеНовостнойЛенты(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ГлавнаяСтраница	= Булево(ПараметрыСсылки.mainpage);
	ПредСтраница	= Число(ПараметрыСсылки.prevpage);
	ТекСтраница		= Число(ПараметрыСсылки.currpage);
	Количество		= Число(ПараметрыСсылки.limit);
	Идентификатор	= ?(ПараметрыСсылки.Свойство("id"), ПараметрыСсылки.id, "");
	
	Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
		УникальныйИдентификатор	= Новый УникальныйИдентификатор(Идентификатор);
		НовостиСсылка = Справочники.НовостиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ПараметрыВыполнения.Вставить("ГлавнаяСтраница"		, ГлавнаяСтраница);
	ПараметрыВыполнения.Вставить("Количество"			, Количество);
	ПараметрыВыполнения.Вставить("ПредыдущаяСтраница"	, ПредСтраница);
	ПараметрыВыполнения.Вставить("ТекущаяСтраница"		, ТекСтраница);
	ПараметрыВыполнения.Вставить("Ссылка"				, НовостиСсылка);
	
	Возврат БазаЗнанийHTML.ПолучитьБлокНовости(ПараметрыВыполнения);
	
КонецФункции

Функция ПолучитьДанныеОбновленияСтатей(СтруктураКартинок, ПараметрыСсылки, ДопНастройки) Экспорт
	
	АдресаКартинок = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураКартинок Цикл
		АдресаКартинок.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение.Путь);
	КонецЦикла;
	
	ПредСтраница	= Число(ПараметрыСсылки.prevpage);
	ТекСтраница		= Число(ПараметрыСсылки.currpage);
	Количество		= Число(ПараметрыСсылки.limit);
	ВидСтраницы		= СокрЛП(ПараметрыСсылки.type);
	
	СтатьяСсылка	= Справочники.СтатьиБазыЗнаний.ПустаяСсылка();
	Если ПараметрыСсылки.Свойство("id") Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрыСсылки.id) Тогда
			УникальныйИдентификатор	= Новый УникальныйИдентификатор(ПараметрыСсылки.id);
			СтатьяСсылка = Справочники.СтатьиБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	КатегорияСсылка	= Справочники.КатегорииБазыЗнаний.ПустаяСсылка();
	Если ПараметрыСсылки.Свойство("category") Тогда
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрыСсылки.category) Тогда
			УникальныйИдентификатор	= Новый УникальныйИдентификатор(ПараметрыСсылки.category);
			КатегорияСсылка = Справочники.КатегорииБазыЗнаний.ПолучитьСсылку(УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыВыполнения	= Новый Структура;
	ПараметрыВыполнения.Вставить("ОснКартинки"	, АдресаКартинок);
	ПараметрыВыполнения.Вставить("ДопКартинки"	, Новый Массив);
	ПараметрыВыполнения.Вставить("ДопНастройки"	, ДопНастройки);
	
	ПараметрыВыполнения.Вставить("Количество"			, Количество);
	ПараметрыВыполнения.Вставить("ПредыдущаяСтраница"	, ПредСтраница);
	ПараметрыВыполнения.Вставить("ТекущаяСтраница"		, ТекСтраница);
	ПараметрыВыполнения.Вставить("ВидСтраницы"			, ВидСтраницы);
	ПараметрыВыполнения.Вставить("Ссылка"				, СтатьяСсылка);
	ПараметрыВыполнения.Вставить("Категория"			, КатегорияСсылка);
	
	Возврат БазаЗнанийHTML.ПолучитьБлокСтатьи(ПараметрыВыполнения);
	
КонецФункции