#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Взаимодействия.ПриЗаписиДокумента(ЭтотОбъект);
	УправлениеЭлектроннойПочтой.УстановитьПометкуУдаленияУВложенийПисьма(Ссылка, ПометкаУдаления);
	Взаимодействия.ОтработатьПризнакИзмененияПометкиУдаленияПриЗаписиПисьма(ЭтотОбъект);
	
	//Запись информации о взаимодействиях в справочник
	аэОбщийМодульСервер.ЗаписатьСтрутуруВзаимодействия(Ссылка);
		
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	УправлениеЭлектроннойПочтой.УдалитьВложенияУПисьма(Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ПометкаУдаления",
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка,"ПометкаУдаления"));
	//Сокращение поля Текст письма - избавление от двойного симовола ВК
	
	Двойной1013 = Символ(10) + Символ(13);
	Двойной1310 = Символ(13) + Символ(10);
	Двойной1010 = Символ(10) + Символ(10);
	Двойной1313 = Символ(13) + Символ(13);
	
	Двойной13СПробелом = Символ(13) + Символ(160) + Символ(13);
	ВремТекст = Текст;
	
	Пока Истина Цикл
		
		Если СтрНайти(ВремТекст, Двойной1013) = 0 И СтрНайти(ВремТекст, Двойной1310) = 0 И СтрНайти(ВремТекст, Двойной1010) = 0 И СтрНайти(ВремТекст, Двойной1313) = 0 И СтрНайти(ВремТекст, Двойной13СПробелом) = 0 Тогда
			Прервать;
		КонецЕсли;
		
		ВремТекст = СтрЗаменить(ВремТекст, Двойной1310, Символ(13));
		ВремТекст = СтрЗаменить(ВремТекст, Двойной1013, Символ(13));
		ВремТекст = СтрЗаменить(ВремТекст, Двойной1010, Символ(13));
		ВремТекст = СтрЗаменить(ВремТекст, Двойной1313, Символ(13));
		ВремТекст = СтрЗаменить(ВремТекст, Двойной13СПробелом, Символ(13));
		
		
	КонецЦикла;
	
	Если Сред(ВремТекст, 1, 1) = Символ(13) Тогда
		ВремТекст = Сред(ВремТекст, 2, СтрДлина(ВремТекст) - 1);
	КонецЕсли;
	
	Если Сред(ВремТекст, СтрДлина(ВремТекст), 1) = Символ(13) Тогда
		ВремТекст = Сред(ВремТекст, 1, СтрДлина(ВремТекст) - 1);
	КонецЕсли;
	
	Текст = ВремТекст;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли