////////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ ФОРМОЙ

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Пользователь.Видимость = (Объект.ВидПользователя = 0);
	Элементы.Имя.Видимость			= (Объект.ВидПользователя = 1);
	Элементы.Пароль.Видимость		= (Объект.ВидПользователя = 1);
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	Объект.Наименование = Строка(Объект.Пользователь);
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	Объект.Наименование = СокрЛП(Объект.Имя);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидПользователяПриИзменении(Элемент)
	Если Объект.ВидПользователя = 0 Тогда
		Объект.Имя		= "";
		объект.Пароль	= "";
	ИначеЕсли Объект.ВидПользователя = 1 Тогда
		Объект.Пользователь = Неопределено;
	КонецЕсли;
	
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Предопределенный Тогда
		ЭтотОбъект.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА КОМАНД ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ
