
&НаКлиенте
Процедура АутентификацияWindowsПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ФлагВидимости = НЕ Объект.АутентификацияWindows;
	
	Элементы.ЛогинSQL.Видимость = ФлагВидимости;
	Элементы.ПарольSQL.Видимость = ФлагВидимости;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТаблицуХраненияЗначений(Команда)
	Флаг = СоздатьТаблицуХраненияЗначенийСервер();
	
	Если Флаг Тогда
		Сообщить("Таблица хранения данных для офлайн мониторинга успешно создана (пересоздана)!");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция СоздатьТаблицуХраненияЗначенийСервер()
	
	
	 Возврат Мониторинг.СоздатьТаблицуХраненияЗначенийСервер(Объект);
	
КонецФункции
